# Brewfile - Core tools for development environment
# Install: brew bundle install

# Taps
tap "nikitabobko/tap"

# Core CLI tools
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Modern ls replacement
brew "fd"           # Fast file finder
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Fast grep
brew "zoxide"       # Smart cd

# Development
brew "git"
brew "gh"           # GitHub CLI
brew "neovim"
brew "tmux"
brew "jq"           # JSON processor

# Shell
brew "zsh"
brew "starship"     # Cross-shell prompt

# Node.js
brew "nvm"

# Optional: Uncomment as needed
# brew "python@3.13"
# brew "postgresql@17"
# brew "redis"
# brew "awscli"

# Casks (GUI apps)
cask "karabiner-elements"
cask "nikitabobko/tap/aerospace"
cask "font-jetbrains-mono-nerd-font"

# Optional casks
# cask "iterm2"
# cask "claude-code"
